misterniark/Meshpay/sdkconfig.defaults.esp32s3
# Configuration spécifique ESP32-S3 (Waveshare ESP32-S3-Touch-LCD-1.47)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# --- PSRAM (8MB octal SPI) ---
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# --- Secure Boot V2 (PRODUCTION UNIQUEMENT) ---
# ESP32-S3 supporte nativement Secure Boot V2 (pas de restriction de revision).
# Non active par defaut car necessite :
#   1. Une cle RSA-3072 generee avec :
#      espsecure.py generate_signing_key --version 2 secure_boot_key.pem
#   2. Brulage irreversible des eFuses au premier boot
#
# Pour activer, decommenter :
# CONFIG_SECURE_BOOT=y
# CONFIG_SECURE_BOOT_V2_ENABLED=y
# CONFIG_SECURE_BOOT_BUILD_SIGNED_BINARIES=y
